CREATE TABLE `люди` (
  `﻿id` tinyint(4) DEFAULT NULL,
  `ФИО` varchar(14) DEFAULT NULL,
  `Д/р` mediumint(9) DEFAULT NULL,
  `Статус` varchar(6) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
INSERT INTO `люди` VALUES (1,'Иванов И. И.',32916,'женат'),(2,'Иванов И. И.',37152,'холост'),(3,'Петров П. П.',30429,'женат'),(4,'Васильев В. В.',35936,'холост'),(25,'Кузьмин К.К.',43972,'холост');

CREATE TABLE `телефоны` (
  `﻿Чей телефон` tinyint(4) DEFAULT NULL,
  `Тел` smallint(6) DEFAULT NULL,
  `Коммент` varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
INSERT INTO `телефоны` VALUES (1,123,'личный'),(1,124,'рабочий'),(1,125,'для поездок'),(1,126,'интернет'),(1,127,'старый'),(2,527,'личный'),(3,234,'личный'),(3,235,'рабочий'),(4,456,'личный'),(11,999,'личный'),(12,997,'рабочий'),(13,995,'личный'),(14,993,'для поездок'),(15,991,'для поездок');

CREATE TABLE `адреса` (
  `﻿Чей адрес` tinyint(4) DEFAULT NULL,
  `Адрес` varchar(15) DEFAULT NULL,
  `Комментарий` varchar(14) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
INSERT INTO `адреса` VALUES (1,'Можга','Место рождения'),(1,'Казань','По прописке'),(1,'Москва','Рабочий'),(2,'Санкт-Петербург','По прописке'),(3,'Москва','По прописке'),(4,'Белгород','По прописке'),(5,'Уфа','По прописке'),(6,'Сочи','По прописке'),(7,'Киров','Рабочий'),(8,'Владивосток','Место рождения'),(9,'Рязань','Рабочий'),(10,'Хабаровск','Место рождения');

CREATE TABLE `общий список` (
  `﻿ФИО` varchar(16) DEFAULT NULL,
  `Д/р` mediumint(9) DEFAULT NULL,
  `Статус` varchar(6) DEFAULT NULL,
  `Тел` smallint(6) DEFAULT NULL,
  `Комментарий` varchar(8) DEFAULT NULL,
  `Адрес` varchar(15) DEFAULT NULL,
  `Группа` varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
INSERT INTO `общий список` VALUES ('Иванов И. И.',32916,'женат',126,'интернет','Можга','Работа'),('Иванов И. И.',32916,'женат',127,'старый','Можга','Работа'),('Иванов И. И.',37152,'холост',527,'личный','Санкт-Петербург','Школа'),('Петров П. П.',30429,'женат',234,'личный','Москва','Родня'),('Петров П. П.',30430,'женат',235,'рабочий','Москва','Родня'),('Васильев В. В.',35936,'холост',456,'личный','Белгород','Друзья'),('Сидоров С.С.',39276,'холост',643,'личный','Киров','Родня'),('Сидоров С.С.',39276,'холост',654,'старый','Киров','Родня'),('Александров А.А.',31841,'женат',412,'рабочий','Уфа','Друзья'),('Борисов Б.Б',32736,'холост',723,'рабочий','Москва','Работа'),('Михайлов М.М.',35438,'женат',876,'личный','Сочи','Университет'),('Михайлов М.М.',35438,'женат',875,'рабочий','Сочи','Университет'),('Кириллов К.К.',35402,'холост',933,'личный','Киров','Работа');
